<a href="https://colab.research.google.com/github/gyujin0450/Rstudy/blob/master/302_%EB%8D%B0%EC%9D%B4%ED%84%B0%EC%A0%84%EC%B2%98%EB%A6%AC(2).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
# 데이터전처리(2) : arrange, group_by, summarise
install.packages("ggplot2")

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

In [3]:
library(ggplot2)

In [14]:
library(dplyr)

Attaching package: ‘dplyr’


The following objects are masked from ‘package:stats’:

    filter, lag


The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union

In [4]:
head(diamonds,10)

   carat cut       color clarity depth table price x    y    z
1  0.23  Ideal     E     SI2     61.5  55    326   3.95 3.98 2.43
2  0.21  Premium   E     SI1     59.8  61    326   3.89 3.84 2.31
3  0.23  Good      E     VS1     56.9  65    327   4.05 4.07 2.31
4  0.29  Premium   I     VS2     62.4  58    334   4.20 4.23 2.63
5  0.31  Good      J     SI2     63.3  58    335   4.34 4.35 2.75
6  0.24  Very Good J     VVS2    62.8  57    336   3.94 3.96 2.48
7  0.24  Very Good I     VVS1    62.3  57    336   3.95 3.98 2.47
8  0.26  Very Good H     SI1     61.9  55    337   4.07 4.11 2.53
9  0.22  Fair      E     VS2     65.1  61    337   3.87 3.78 2.49
10 0.23  Very Good H     VS1     59.4  61    338   4.00 4.05 2.39

In [8]:
# 'https://github.com/siestageek/datasets/blob/master/rdata/sungjuk.rdata?raw=true'
load('sungjuk.rdata')

In [10]:
str(sungjuk)

'data.frame':	4 obs. of  4 variables:
 $ name: Factor w/ 4 levels "Jane","John",..: 2 4 3 1
 $ eng : num  90 95 69 78
 $ mat : num  85 96 49 95
 $ sci : num  90 80 70 60

In [11]:
summary(sungjuk)

   name        eng             mat             sci
 Jane:1   Min.   :69.00   Min.   :49.00   Min.   :60.0
 John:1   1st Qu.:75.75   1st Qu.:76.00   1st Qu.:67.5
 Mark:1   Median :84.00   Median :90.00   Median :75.0
 Tom :1   Mean   :83.00   Mean   :81.25   Mean   :75.0
          3rd Qu.:91.25   3rd Qu.:95.25   3rd Qu.:82.5
          Max.   :95.00   Max.   :96.00   Max.   :90.0

In [12]:
head(sungjuk)

  name eng mat sci
1 John 90  85  90
2 Tom  95  96  80
3 Mark 69  49  70
4 Jane 78  95  60

In [ ]:
# 데이터 정렬 : arrange(변수명,...)

In [18]:
sungjuk %>% arrange(name) # 이름으로 오름차순

  name eng mat sci
1 Jane 78  95  60
2 John 90  85  90
3 Mark 69  49  70
4 Tom  95  96  80

In [16]:
sungjuk %>% arrange(desc(name)) # 이름으로 내림차순

  name eng mat sci
1 Tom  95  96  80
2 Mark 69  49  70
3 John 90  85  90
4 Jane 78  95  60

In [19]:
sungjuk %>% arrange(desc(eng),desc(mat),desc(sci)) # 여러변수 내림차순 정렬

  name eng mat sci
1 Tom  95  96  80
2 John 90  85  90
3 Jane 78  95  60
4 Mark 69  49  70

In [ ]:
# 집계 : summarise(컬럼명 = 집계함수,...)

In [21]:
# 영어 평균 점수
sungjuk %>% summarise(영어평균 = mean(eng))

  영어평균
1 83

In [22]:
sungjuk

  name eng mat sci
1 John 90  85  90
2 Tom  95  96  80
3 Mark 69  49  70
4 Jane 78  95  60

In [25]:
# 수학 최고,최저 점수
sungjuk %>% summarise(수학최고점수 = max(mat),수학최저점수 = min(mat))

  수학최고점수 수학최저점수
1 96           49

In [27]:
# 데이터 그룹화 : group_by(컬럼,...)
sungjuk$class <- c(2,1,2,1)

In [28]:
# class별 평균 영어점수
sungjuk %>% group_by(class) %>% summarise(영어평균 = mean(eng))

`summarise()` ungrouping output (override with `.groups` argument)

  class 영어평균
1 1     86.5
2 2     79.5

In [29]:
# class별 최고/최소 영어점수
sungjuk %>% group_by(class) %>% summarise(최고영어점수 = max(eng),최소영어점수 = min(eng))

`summarise()` ungrouping output (override with `.groups` argument)

  class 최고영어점수 최소영어점수
1 1     95           78
2 2     90           69

In [30]:
sungjuk

  name eng mat sci class
1 John 90  85  90  2
2 Tom  95  96  80  1
3 Mark 69  49  70  2
4 Jane 78  95  60  1